---
title: ConnectorFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ConnectorFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 41
---

# ConnectorFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AirTerminalCenterNotAligned { get; }` | `ConnectorFailures.AirTerminalCenterNotAligned` | FailureDefinitionId |
| `FailureDefinitionId AllElementsRemovedFromCircuitGroup { get; }` | `ConnectorFailures.AllElementsRemovedFromCircuitGroup` | FailureDefinitionId |
| `FailureDefinitionId DisconnectedElements { get; }` | `ConnectorFailures.DisconnectedElements` | FailureDefinitionId |
| `FailureDefinitionId ElementAssignedToDefaultSystem { get; }` | `ConnectorFailures.ElementAssignedToDefaultSystem` | FailureDefinitionId |
| `FailureDefinitionId ElementHasMultipleConnectors { get; }` | `ConnectorFailures.ElementHasMultipleConnectors` | FailureDefinitionId |
| `FailureDefinitionId ElementsAreDisconnected { get; }` | `ConnectorFailures.ElementsAreDisconnected` | FailureDefinitionId |
| `FailureDefinitionId ElementsConnectedToParent { get; }` | `ConnectorFailures.ElementsConnectedToParent` | FailureDefinitionId |
| `FailureDefinitionId ElementsNeedToBeDisconnected { get; }` | `ConnectorFailures.ElementsNeedToBeDisconnected` | FailureDefinitionId |
| `FailureDefinitionId ExistsForSelectedElement { get; }` | `ConnectorFailures.ExistsForSelectedElement` | FailureDefinitionId |
| `FailureDefinitionId FittingMustBeOnDuct { get; }` | `ConnectorFailures.FittingMustBeOnDuct` | FailureDefinitionId |
| `FailureDefinitionId FittingMustBeOnDuctWarn { get; }` | `ConnectorFailures.FittingMustBeOnDuctWarn` | FailureDefinitionId |
| `FailureDefinitionId FittingMustBeOnPipe { get; }` | `ConnectorFailures.FittingMustBeOnPipe` | FailureDefinitionId |
| `FailureDefinitionId FittingMustBeOnPipeWarn { get; }` | `ConnectorFailures.FittingMustBeOnPipeWarn` | FailureDefinitionId |
| `FailureDefinitionId InvalidConnectionRef { get; }` | `ConnectorFailures.InvalidConnectionRef` | FailureDefinitionId |
| `FailureDefinitionId InvalidConnector { get; }` | `ConnectorFailures.InvalidConnector` | FailureDefinitionId |
| `FailureDefinitionId InvalidLoadClassificationValue { get; }` | `ConnectorFailures.InvalidLoadClassificationValue` | FailureDefinitionId |
| `FailureDefinitionId InvalidPowerFactorValue { get; }` | `ConnectorFailures.InvalidPowerFactorValue` | FailureDefinitionId |
| `FailureDefinitionId JointGenderMismatch { get; }` | `ConnectorFailures.JointGenderMismatch` | FailureDefinitionId |
| `FailureDefinitionId JointShapeMismatch { get; }` | `ConnectorFailures.JointShapeMismatch` | FailureDefinitionId |
| `FailureDefinitionId JointSizeMismatch { get; }` | `ConnectorFailures.JointSizeMismatch` | FailureDefinitionId |
| `FailureDefinitionId JointTypeMismatch { get; }` | `ConnectorFailures.JointTypeMismatch` | FailureDefinitionId |
| `FailureDefinitionId LayoutConnector { get; }` | `ConnectorFailures.LayoutConnector` | FailureDefinitionId |
| `FailureDefinitionId MismatchNoAvailableConnector { get; }` | `ConnectorFailures.MismatchNoAvailableConnector` | FailureDefinitionId |
| `FailureDefinitionId MultipleNetwork { get; }` | `ConnectorFailures.MultipleNetwork` | FailureDefinitionId |
| `FailureDefinitionId NetworkValidityError { get; }` | `ConnectorFailures.NetworkValidityError` | FailureDefinitionId |
| `FailureDefinitionId NetworkValidityErrorWasDisconnected { get; }` | `ConnectorFailures.NetworkValidityErrorWasDisconnected` | FailureDefinitionId |
| `FailureDefinitionId NoLossDefined { get; }` | `ConnectorFailures.NoLossDefined` | FailureDefinitionId |
| `FailureDefinitionId NoSupportKCoefficientTable { get; }` | `ConnectorFailures.NoSupportKCoefficientTable` | FailureDefinitionId |
| `FailureDefinitionId NotAllowedToModifyGroupElementsError { get; }` | `ConnectorFailures.NotAllowedToModifyGroupElementsError` | FailureDefinitionId |
| `FailureDefinitionId NotAllowedToModifyGroupElementsWarning { get; }` | `ConnectorFailures.NotAllowedToModifyGroupElementsWarning` | FailureDefinitionId |
| `FailureDefinitionId OpenConnector { get; }` | `ConnectorFailures.OpenConnector` | FailureDefinitionId |
| `FailureDefinitionId RbsNetworkValidityError { get; }` | `ConnectorFailures.RbsNetworkValidityError` | FailureDefinitionId |
| `FailureDefinitionId RemoveConnectorLinksWarn { get; }` | `ConnectorFailures.RemoveConnectorLinksWarn` | FailureDefinitionId |
| `FailureDefinitionId RemoveConnectorLinkWarn { get; }` | `ConnectorFailures.RemoveConnectorLinkWarn` | FailureDefinitionId |
| `FailureDefinitionId ShapesNotMatch { get; }` | `ConnectorFailures.ShapesNotMatch` | FailureDefinitionId |
| `FailureDefinitionId SizingCalculationFlowOnlyWarn { get; }` | `ConnectorFailures.SizingCalculationFlowOnlyWarn` | FailureDefinitionId |
| `FailureDefinitionId SizingCalculationNoneWarn { get; }` | `ConnectorFailures.SizingCalculationNoneWarn` | FailureDefinitionId |
| `FailureDefinitionId SizingFailed { get; }` | `ConnectorFailures.SizingFailed` | FailureDefinitionId |
| `FailureDefinitionId UnconnectedCircuit { get; }` | `ConnectorFailures.UnconnectedCircuit` | FailureDefinitionId |
| `FailureDefinitionId UnconnectedDevice { get; }` | `ConnectorFailures.UnconnectedDevice` | FailureDefinitionId |
| `FailureDefinitionId UndefinedConnector { get; }` | `ConnectorFailures.UndefinedConnector` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```